week_4/quiz_4.tex
% Created 2024-07-05 Fri 08:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\date{}
\title{Quiz: Electronics Product Mix Decisions}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Quiz: Electronics Product Mix Decisions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:org9e76f8e}

\textbf{Answer:} 3\\

There are three decision variables, one for each type of product.
\section*{Problem 2}
\label{sec:orgd3471f3}

\textbf{Answer:}
\begin{equation*}
\max\quad Z=75x_1+50x_2+35x_3
\end{equation*}
\vspace{0.1cm}

The profit per TV set is \$75. Since \(x_1\) TVs are produced, the profit
related to this product is \(75x_1\). The same logic allows us to determine
the profit related to stereos and speakers. The stereos generate a profit of
\(50x_2\), and the speakers generate a profit of \(35x_3\). Therefore, the
total profit can be expressed as
\begin{equation}
Z=75x_1+50x_2+35x_3.
\end{equation}
For this problem, this is the objective function. Since it represents profit, we
obviously want to maximize this function. In other words, we want to find
\(\max Z\).
\section*{Problem 3}
\label{sec:orgd435435}

\textbf{Answer:} \(x_1+x_2\leq 450\)\\

Each TV set requires 1 chassis. The same is true for each stereo. On the other
hand, speakers don't require a chassis. Then the total number of chassis the
company needs is given by \(x_1+x_2\). Since it's not possible to use more
than 450 chassis, the following must hold:
\begin{equation}
x_1+x_2\leq 450.
\end{equation}
\section*{Problem 4}
\label{sec:org5e15bdc}

\textbf{Answer:} \(2x_1+x_2+x_3\leq 600\)\\

Each TV set requires 2 electronic parts. For each stereo/speaker, we need a
single electronic part. Then the total number of such parts the company needs is
given by \(2x_1+x_2+x_3\). Since it's not possible to use more than 600
electronic parts, the following must hold:
\begin{equation}
2x_1+x_2+x_3\leq 600.
\end{equation}
\section*{Problem 5}
\label{sec:org8e2f37c}

\textbf{Answer:} \texttt{SUMPRODUCT(\$D\$5:\$F\$5,D7:F7)}
\section*{Problem 6}
\label{sec:org0c48417}

\textbf{Answer:} \texttt{SUMPRODUCT(D5:F5,D12:F12)}
\section*{Problem 7}
\label{sec:org91fbc11}

\textbf{Answer:} 200 units of TV sets, 200 units of stereos, and none of speakers
\section*{Problem 8}
\label{sec:org2b25ee9}

\textbf{Answer:} Chassis, Picture tubes, and Power supply
\section*{Problem 9}
\label{sec:org961c144}

\textbf{Answer:} \$25000
\section*{Problem 10}
\label{sec:org32a2c13}

\textbf{Answer:} All of the above.
\end{document}
